[
  {
    "id": "discovered",
    "title": "discovered",
    "body": "A raindrop engulfed a tear as it fell on a withering white rose. The delicate flower lay on the edge of the sidewalk pointing to a broken soul. At a corner in downtown Portland a lonely young lady stood silently crying.\n\nShe wore a stained pearl-white 1940 silk-gown that shimmered under the lighted post. Her matted dark brown hair dragged heavy below her shoulders from the collected raindrops. Exposed blackened feet revealed there was no one coming for her, at least not tonight.\n\nAn angelic opera voice surfaced from the girl’s slim body, releasing a heartfelt story. Translucent raindrops and the late night sounds went flat as an unseen power prepared the hush. Bel Canto “Wishing You Were Somehow Here Again” began its crescendo down semi-busy streets.\n\nPowerful words entangled in solid notes ricocheted off high rise buildings heading to the heavens. People going somewhere, heard the wistful voice which stirred their spirits causing a course change. They gravitated toward the enchanting melancholy melody setting something free within them. \n\nExposed by the song and emotions the tune revealed the girl’s need for kindness and gentleness. Homeless man placed an empty jar by her dirty feet, dropping a few coins, making jingling sounds. A listener picked-up the white tarnish rose wrapping it with wadded dollar bills setting it in the jar.\n\nA woman in spike heels wiped her eyes, released a deep sigh and dropped a neatly folded ten. A young man wrote her a note, “Hope you get discovered, you belong on a stage not on the streets.” Several teens recorded the scene, sent the video to their friends, making the moment a phenomenon. \n\nHer eyes opened, her hands quickly covered her mouth as she fell to her knees. With unbelief of what stood before her, tears fell without raindrops on the stage floor. She thanked the One who found her as the audience stood to their feet and applause filled the room.",
    "createdAt": "Wed Oct 23rd",
    "category": "poem"
  },
  {
    "id": "a-little-soldier-girl",
    "title": "why not me",
    "body": "Three little birds perched on a limb\nOne looking toward you\nAnother looking towards me\nOne is bought to keep company\nThe second to sing precious melodies\n\nThe third one looked up and asked,\n\"Why not me?\"\n\nThree little birds perched on a limb\nOne looking toward you\nAnother looking towards me\nOne is bought to keep company\nThe second to sing precious melodies\n\nThe third one looked up and sang,\n\"I'll sing and keep them company.\"\n",
    "createdAt": "Sat Oct 12th",
    "category": "poem"
  }
]
