[
  {
    "id": "he-waltzed-into-her-heart",
    "title": "he waltzed into her heart",
    "category": "short story",
    "body": "Hands folded in her lap. Chrystal sat in a row of empty chairs at a dance studio. *Why did I come without Liz? It feels awkward to be here without her*. She fidgeted. *Oh yes, I promised to go with her to her sorority senior ball. Even though I don’t enjoy dancing*. Being her older sister comes with sacrifices. Suddenly a young man towered over her.\n\"Join me, please.\" He extended his hand.\n*I can hear Liz say, I dare you*! Timidly, she placed her hand in his. \"I don't follow well.\"\n\"I accept the challenge.\" The young man guided Chrystal to the dance floor. \"I’m John, by the way.\"\nWithout replying, Chrystal shook her sweaty hands before posing her arms for the waltz. John held her hand, placed his right hand on her left shoulder, leaving space between them. As Chrystal placed her left hand on his upper arm, she noticed a college-age girl casually speaking to her dance partner. Her heart raced. *If only I could be that relaxed*. She looked away.\n\"You're Chrystal, right? I heard your name called when the class began.\" He angled his face down to hers. \"You're shivering. Shall I get my jacket for you?\"\n\"No. I mean, yes, my name is Crystal, but no, I'm not cold.\" *It's more fun watching others dance than dancing. Standing here waiting is nerve wrecking*. She straightened her back.\nJohn repositioned his grip. The top of Chrystal’s head peaked above his shoulder. She glanced again at the college-age girl. *I must relax*. She exhaled. Her left elbow dropped.\nAbela, the instructor, raised her elbow, repositioned Chrystal’s hand on John’s bicep  and said, \"Remember ladies, the left elbow is always parallel to the floor. Gentlemen, hold your partner close.\" Abela brought Crystal and John closer. \"Don't forget, right side to right side.\"\n*I hope I won’t step on his feet too much*. She sighed.\n\"Doesn't her Colombian accent make you want to dance the Salsa?\" John shifted his feet to the dance steps.\n*Not really*. Chrystal shifted her weight. \"Be prepared. Like I said, I don't follow well.\"\n\"I heard you.\" John whispered to her. \"It's probably because you haven't been led gently.\"\nShe pulled away slightly.\n\"Don’t run away.\" John drew her back in. \"Place your feet on top of mine, feel the rhythm and trust my lead.\"\n\"You're kidding.\" She said, stepping back.\nThe music started. With his hand around her waist, John drew her closer, lifted her and stepped to the rhythm of the dance.\n\"What are you doing?\" Her feet dangled in the air. \"Put me down.\"\n\"You're light as a feather.\" John stayed in step with the class. \"This will be fun.\" He held her closer. \"Don't you think?\"\nChrystal spoke through clenched teeth. \"Put me down. Or I'll...I'll scream.\" She noticed a few dancers smile as they passed them. She grimaced.\n\"By the way, would you like to know how I got my name, John?\"\n\"What?\" Chrystal responded.\n\"Well, do you?\"\n\"No, I don't care. Please put me down before I kick you.\" Her foot was ready for a kick but stopped. She noticed her rhythm synchronizing to John's movements. *I'm moving with him. This is a first*.\n\"Promise me you won't kick or leave me when I put you down. But do try to guess the answer to my question.\"\nChrystal felt crabby. \"What question?\"\n\"About my name.\"\n\"Fine. Tell me.\" She began to calm down as she swayed slightly to the music.\n\"Take a wild guess.\"\n\"You're crazy.\"\nJohn responded, \"You're right. Crazy is my middle name, given to me by my older brothers.\" Then he swiftly moved inside the dancing circle taking center stage.\n\"Okay, okay. I won't kick you. I'll dance with you, but you must put me down.\"\n\"You're placing your feet on mine. Right?\" John didn't release her.\nChrystal snapped: \"I'm not a child.\"\n\"Listen, when your feet land on mine you'll have nothing to worry about. You can focus on the rhythm.\"\nShe murmured, \"fine.\"\nJohn let her down. \"Good. I'm glad you trust me.\"\nThe tips of her shoes rested on John's shiny black ones. She easily followed his lead. The music ended. She was about to remove her feet from John's shoes, but she froze at Abela’s command.\n\"Don't move. Stay where you are.\" Abela clapped her hands. \"Great job, everyone. Gentlemen keep your lady close. We're going to practice the dance again and again. I don't want your muscles to forget what you've learned.\"\n\"It seems strange she didn’t ask us to keep our regular partner,\" Chrystal commented as her previous partner danced with another girl.\nJohn lifted his eyebrows. \"Well, there is always a first for everything.\"\n\"That’s for sure.\"\nThe waltz music started. Chrystal allowed her body to relax. She felt the breeze from the rise and fall movements and from the gliding of their feet. John smiled as he looked into her eyes.\n\"You're enjoying this, aren't you?\" Chrystal asked.\n\"Very much.\"\n\"Well, you're nuts.\"\n\"You sure figured that part about me.\" John turned swiftly making her skirt flair. \"Since you're not going to guess why my name is John. I'll tell you. I was named after John the Baptist, because of how I was baptized.\"\n\"John the who?\"\n\"I'll tell you about him when we go to dinner after our lesson.\" John kept pace to the music. \"When I was four, I heard the preacher talk about . . .\"\n*Going to dinner? With a stranger? I don’t think so*.\n\"Heaven and hell. I didn't want to land in hell. I wanted to be baptized and . . .\"\n*Hell? He’s so weird*.\n\". . . headfirst, I was dunked in the toilet . . .\"\n\"Wait! Did I hear you say toilet?\" Chrystal interrupted.\n\"Yep. My mom found me with my head in the toilet. My brothers flushed it and baptized me. Soon after my baptism, they changed my name from Harold the Baby to John the Baptist.\"\nHer feet slipped off his. She thought to place them back as the music played.\n\"Look at you. You're doing marvelous,\" John complemented her.\n\"Me? You're the one dancing. I'm just following.\"\n\"But I thought you said you couldn’t follow?\"\n\"This isn't following.\"\n\"What is it then?\"\n\"I need my feet on the floor, not on your shoes.\" Chrystal exclaimed.\n\"That's funny.\"\nShe stared at John then asked, \"What's funny?\"\n\"Your feet are on the floor.\" He focused on her eyes. \"Wait. Don't look down. Keep your eyes on me. Believe me. I'm not lying. Keep thinking your feet are on mine and follow my lead.\"\nChrystal gazed at his eyes for the first time. *His eyes are so honestly brown. Why do I feel lightheaded?*\nJohn's pace slowed like a carousel ride coming to an end. \"You're finally relaxed. I'm glad.\"\n\"Glad?\"\n\"Yes. You're beginning to trust me.\"\n\"I am?\"\n\"Of course, how else would you follow my lead? Trust comes from a gentle touch. Or a lady could never truly follow.\"\nChrystal realized everyone had stopped dancing. \"The music's over.\"\nJohn came down from his dancing step. \"I know.\" He escorted her to the edge of the dance floor as everyone clapped.\nShe didn't let go of his hand as Abela announced. \"It's been a successful dance. Let's practice once more. Music please.\" Adela clapped her hands and counted, \"One, two, three.\"\n\"Would you like another dance with me?\" John bowed.\n\"I would, John -- or is it, Harold? The kid that got his head stuck in the toilet.\" Chrystal chuckled as they began to dance.\n\"It didn't get stuck. I was baptized. Make sure you get your facts straight.\" He drew her close. \"Remember, side to side.\"\nAs the others stepped to the swing of the song, John stepped into Chrystal's heart. She searched his eyes. \"You know, for a while, I thought you were a lunatic.\" Her neck tightened. \"Hope I didn't offend you.\"\n\"I know. No offense taken.\" He led as if they were ice skating. \"I watched your face change from being timid and fearful to concerned, then angry, then embarrassed. Now it's ending with a smile.\"\n\"You noticed all that in two dances.\"\n\"I also noticed how your beautiful hazel eyes changed color with your emotions.\"\n\"People say it's a myth about eye-color changing.\"\n\"We could discuss if this is really a myth.\" John had a puppy-pleading look. \"Dinner? After class?\"\n\"Food sounds good. Will you tell me more about your toilet experience?\"\n\"I'd love to. Will you dance with me next Friday?\"\nChrystal tiptoed to the music's beat, \"Yes, I’ll dance with you next week.\" Carefree, she followed his lead. *I’m glad Liz didn’t come to class tonight*.",
    "createdAt": "Sat Nov 2nd"
  },
  {
    "id": "an-unexpected-date",
    "title": "an unexpected date",
    "category": "short story",
    "body": "With no customers in the store, I jotted the total of the afternoon sales. After shutting the register drawer, I placed its key in my top shirt pocket. Jittery I paced back and forth. Why? Because of family. In a couple of days relatives will arrive for the holiday. And the dreaded question will be unpacked before the suitcases make it upstairs. *Do you have a boyfriend yet?*\nThe words echoed in my mind. Every time someone visits my family this question is thrown out. Regret for helping with the family's bookstore while my father attended a writer's convention began to set in. *I should have gone to Hawaii with my friends. But no, I had to be dutiful and responsible to my family. Why did I have to tell mom I had no rotations for the winter session?* The joy of the season didn't dwell within me. Only a troubled spirit.\nSomething hit me on my head and plopped to the floor. I glanced up. A red string swayed from the ceiling. I stepped back. My right foot slipped. Regaining my balance I noticed I had smashed a small green branch. *I can't believe it, Mama, how could you? A mistletoe? I clenched my teeth and felt my nose flare. A tiny piece of leaf slid from my shoulder length brown hair.\n*What was she hoping for? That a perfect stranger would bend over the counter, kiss me and sweep me off my feet? Boy, she must be more concerned about my singleness than abuelita ever was.* I picked up the small branch. The register key fell out of my shirt pocket and slid under the counter. I threw away the mistletoe. On my knees, I looked for the key. *Just because I'm turning thirty-six soon, doesn't mean I need a boyfriend. Besides, the right fellow hasn't entered my world.*\n\"Jingle, jingle.\" The bell warned me, a customer had entered the bookstore.\n*Why now? I better find that key.* Flat on the floor, I reached under the counter. I felt the small metal on the tip of my fingers. \"How did you get here?\" I grumbled as I scooted the key into the palm of my hand.\n\"I walked.\" a baritone male's voice answered, then asked. \"Are you alright?\"\n\"Yes, I am.\" I said boldly. On my way up, I bumped my head on the edge of the counter.\n\"Ouch. I heard that thump. It must have hurt.\" The customer commented before asking \"Can I help you?\"\nShort tempered, I answered, \"No, I don't need help.\"  *I, Margarita Maria Rosa Gonzales, get help from nobody, especially from a man I don't know.* Ignoring the pain, I got up and dusted my hands on my pants. Dumbfounded, I stood before a tall, clean-shaven handsome man.\nWith one eyebrow raised he asked, \"Are you sure you don't need assistance?\"\nI placed the key in the front pocket of my jeans and said, \"You must need my help, or else you wouldn't be standing here.\"\nHe responded, \"Do you greet all your customers this way, or am I the lucky fellow?\"\n*Lucky, my foot.* With my self-sufficient ego aside, I asked, \"What can I help you find?\"\n\"Oh, you can be well-mannered. In that case, you may want to wipe that\" he said as he pointed his finger at me, \"from you . . .\" He wiped the part of his black coat that covered his chest. \"And button your shirt.\" His hazel eyes twinkled as he smiled.\nPrideful me, kept my brown eyes engaged with his. I touched the top of my shirt. Realizing it had come unbuttoned, I glanced down. A small piece of mistletoe rested between the crevasse of my breasts. My eyes went back to his.\nHe kept his grin as I buttoned my shirt. The tiny piece of the renegade fell further in between my breasts. I swear it had turned into a worm making itself at home. I turned away, tucked two fingers like chopsticks down my bra and pulled the piece out.\nIn my peripheral vision, I noticed the handsome man had not missed a thing. Nonchalant, I said, \"Now that you've had your peep show, what is it you're looking for?\" I walked around the counter and waited.\nHe scrolled his cell phone. \"Actually, I need to look it up.\"\nBeing the only girl in a Mexican family with six brothers, all older than me, I didn't get embarrassed easily. Even though I was raised like a boy, I was taught it was a sign of weakness to hide who I was born to be -- a woman. I was always told by the women in my family to never be ashamed of my shape, at the same time, I shouldn't flaunt my body. My oldest brother Marcos, would tell me, \"A man doesn't know what to do with a lady who is confident, sure of what she wants and stands her ground on what she believes.\"\n The customer informed me, \"I'm looking for an old poem book.\" He handed me his phone. A jolt of electricity transferred from my hand to his.\nHe quickly pulled his hand back and said, \"boy, you are a fiery one.\"\nIgnoring his comment, I stared at the phone's screen. The sight of two golden bells under the title, \"The Unheard Christmas Melodies\" caused my knees to weaken. Memories of my abuelita, who recently passed away, flooded my mind.\n\"You do, have it? Don't you?\" The stranger sounded concerned. \"I was told your store had a copy.\"\nKeeping my tears at bay, I cleared my throat and said, \"This way.\" I led him to the back of the store and wiped my escaped tears.\n\"You have no idea how long I've been searching for this book. I'm glad you have it.\"\nI swallowed my sadness and asked, \"Is this for someone special?\"\n\"Yes. It's a Christmas present for my grandfather.\"\nI pulled the small book off the shelf, then faced the stranger. A tear rolled down my cheek as I handed the book to him, but I didn't release it.\n\"Is this book special to you?\" He asked as he held the edge of the book.\nI nodded. I released the book. Without a word, I walked back to the counter.\nThe man handed me a twenty-dollar bill. \"May I ask, why is it special?\"\nKeeping my eyes on the register, I answered, \"It's the last copy in our store of my grandmother's first set of poems.\"\n\"Your grandmother wrote this book?\"\n\"Yes, she did. Why does this surprise you?\"\n\"Not as much a surprise as a strange coincidence. Your grandmother's set of poems was the first book my grandfather published. It brought recognition and business to his small publishing company. He's celebrating fifty-five years of business this coming weekend before he closes the company in a few months.\"\nWith the one cent change on the counter, I gripped the register.\n\"I'm sorry to take the last copy, but I hope you understand why I must purchase the book.\" He took the penny and placed it in the small dish of change.\n\"I do. My grandmother would be happy to know who's going to own it.\"\nHe reached for my hand, held it and said, \"Thanks for understanding.\"\nThe stranger walked to the door. \"Jingle, Jingle.\" New York's December wind reached my face. He stopped, returned to the counter, searched my eyes, then asked \"Would you like to join me at my grandfather's dinner celebration?\"\nI felt my face heat up. Before I could process any thoughts, my head nodded yes.\n\"It's this Saturday at six. Can you come?\" His enthusiastic voice flipped my heart.\n\"I can.\" I sheepishly answered and checked my shirt's buttons.\n\"It's a formal dinner. I thought you might want to know.\" He paused. \"Forgive my rudeness, I just realized, I didn't introduce myself, I'm Ethan Kaplan.\" He hesitated. \"What's your name?\"\n\"Margie. Margie, Gonzales.\"\n\"May I call you tomorrow, Margie? Maybe we can meet for coffee.\"\n\"Yes, and yes. Call the shop. I'll be here all day.\"\n\"You should hang a mistletoe up there.\" He pointed where the red string hung. His eyes twinkled the same way when my shirt was unbuttoned.\n\"You may think so. But I won't. I don't want to have another incident.\" I smiled.\n\"Your joyful eyes match my heart. I'm thankful you'll be coming with me. Now I have a date.\" He winked. \"I need to go. Until tomorrow, Margie.\"\n\"Until tomorrow,\" I responded.\nEthan whistled ‘It's a wonderful time of the year' on his way out.\nWith unbelief, I spun with glee and hollered, \"I have a date with a perfect stranger. I'll have to tell Mama how the mistletoe worked in an unexpected way.\"\nAs I opened a box of books a chill came over me. I felt my grandmother close to me. *Abuelita, your book of poems brought a perfect stranger into my life. Only God knew this would happen. Much like how abuelito came into your world when he needed help to find a book at the library.*\nEagerness for tomorrow swelled within me. *I don't have to dread Christmas dinner and the question; do you have a boyfriend yet? Once my aunties know about my Saturday dinner plans, they'll be asking, when is the wedding? Well, at least it'll be a different nagging question. I can put up with this question for a while.* I was glad.\nA quote of my abuelita popped in my head; *the Lord's Joy restores crushed hopes.* Relieved, I placed the new books on a shelf and began to hum a favorite Christmas carol, 'Joy to the World.'\n",
    "verse": {
      "entry": "A joyful heart is good medicine, but a crushed spirit dries up the bones.",
      "reference": "Proverbs 17:22"
    },
    "createdAt": "Tue Oct 29th"
  },
  {
    "id": "a-little-soldier-girl",
    "title": "a little soldier girl",
    "body" : "\"What do you think, sweetie? Is this the one?\" Hannah and her four-year-old child stood in front of a bird cage. In silence she prayed. Lord, please help us find the bird my daughter dreamt about. It would be helpful to have a new melody to help us during these challenging mornings.",
    "verse": {
      "entry": "He put a new song in my mouth, a hymn of praise to our God. Many will see and fear the Lord and put their trust in him.",
      "reference": "Psalm 40:3"
    },
    "category": "short story",
    "createdAt": "Sat Oct 12th"
  },
  {
    "id": "a-seven-year-olds-confession",
    "title": "a seven-year-old's confession",
    "body" : "When will the priest come? Carmelita, a seven-year-old, sat on her hands in a confession booth. Her short legs swung as if they kept time. She looked up. This booth is high. A tall skinny man can fit in here, like Uncle Antonio. But it's not very wide. She spread her arms out. I hope they have a bigger one for Aunt Angelina.",
    "verse": {
      "entry": "Jesus said, 'Let the little children come to me, and do not hinder them, for the kingdom of heaven belongs to such as these.",
      "reference": "Matthew 19:14"
    },
    "category": "short story",
    "createdAt": "Fri Oct 5th"
  },
  {
    "id": "upside-down-wishes",
    "title":"upside down wishes",
    "body" : "On a late summer afternoon, three sisters spent time outside their farmhouse while their parents were away. The youngest, who was four years old, twirled and twirled. Her cornflower blue dress puffed into a bell shape as her loose blonde curls waved in the air. She seemed to not have a care in the world.\nKeeping watch, Marie, the oldest sister, sat reading on the front porch steps. Without looking up, she said, \"Macie, stop twirling. You might make yourself sick like Maggid did last week.\n",
    "verse": {
      "entry": "Take delight in the Lord, and he will give you the desires of your heart.",
      "reference": "Psalm 37:4"
    },
    "category": "short story",
    "createdAt": "Tue Sep 24"
  },
  {
    "id": "weathered-basket",
    "title": "weathered basket",
    "body" : "With my mom's weathered gardening basket in hand, I stepped out my front door. It had not been used in over ten years. Not since my mom began to lose her sight. The last time I held it was a month after her passing, when I packed her belongings away.",
    "verse": {
      "entry": "Three things will last forever—faith, hope, and love—and the greatest of these is love.",
      "reference": "1 Corinthians 13:13 NLT"
    },
    "category": "short story",
    "createdAt": "Tue Jul 25"
  },
  {
    "id": "extended-peace",
    "title": "extended peace",
    "body" : "Out of breath, Marie hiked up a steep mountain. Bells swayed from her backpack to alarm any bears of her presence. More than a mile into the hike, her lungs began to feel the change of elevation. She placed her hands on her hips. Now why am I doing this at my age? What am I trying to prove? To whom am I trying to show off?",
    "verse": {
      "entry": "",
      "reference": ""
    },
    "category": "short story",
    "createdAt": "Mon Jun 19"
  }
]
