[
  {
    "id": "an-unexpected-date",
    "title": "an unexpected date",
    "category": "short story",
    "body": "With no customers in the store, I jotted the total of the afternoon sales. After shutting the register drawer, I placed its key in my top shirt pocket. Jittery I paced back and forth. Why? Because of family. In a couple of days relatives will arrive for the holiday. And the dreaded question will be unpacked before the suitcases make it upstairs. *Do you have a boyfriend yet?*\nThe words echoed in my mind. Every time someone visits my family this question is thrown out. Regret for helping with the family's bookstore while my father attended a writer's convention began to set in. *I should have gone to Hawaii with my friends. But no, I had to be dutiful and responsible to my family. Why did I have to tell mom I had no rotations for the winter session?* The joy of the season didn't dwell within me. Only a troubled spirit.\nSomething hit me on my head and plopped to the floor. I glanced up. A red string swayed from the ceiling. I stepped back. My right foot slipped. Regaining my balance I noticed I had smashed a small green branch. *I can't believe it, Mama, how could you? A mistletoe? I clenched my teeth and felt my nose flare. A tiny piece of leaf slid from my shoulder length brown hair.\n*What was she hoping for? That a perfect stranger would bend over the counter, kiss me and sweep me off my feet? Boy, she must be more concerned about my singleness than abuelita ever was.* I picked up the small branch. The register key fell out of my shirt pocket and slid under the counter. I threw away the mistletoe. On my knees, I looked for the key. *Just because I'm turning thirty-six soon, doesn't mean I need a boyfriend. Besides, the right fellow hasn't entered my world.*\n\"Jingle, jingle.\" The bell warned me, a customer had entered the bookstore.\n*Why now? I better find that key.* Flat on the floor, I reached under the counter. I felt the small metal on the tip of my fingers. \"How did you get here?\" I grumbled as I scooted the key into the palm of my hand.\n\"I walked.\" a baritone male's voice answered, then asked. \"Are you alright?\"\n\"Yes, I am.\" I said boldly. On my way up, I bumped my head on the edge of the counter.\n\"Ouch. I heard that thump. It must have hurt.\" The customer commented before asking \"Can I help you?\"\nShort tempered, I answered, \"No, I don't need help.\"  *I, Margarita Maria Rosa Gonzales, get help from nobody, especially from a man I don't know.* Ignoring the pain, I got up and dusted my hands on my pants. Dumbfounded, I stood before a tall, clean-shaven handsome man. \nWith one eyebrow raised he asked, \"Are you sure you don't need assistance?\"\nI placed the key in the front pocket of my jeans and said, \"You must need my help, or else you wouldn't be standing here.\"\nHe responded, \"Do you greet all your customers this way, or am I the lucky fellow?\"\n*Lucky, my foot.* With my self-sufficient ego aside, I asked, \"What can I help you find?\" \n\"Oh, you can be well-mannered. In that case, you may want to wipe that\" he said as he pointed his finger at me, \"from you . . .\" He wiped the part of his black coat that covered his chest. \"And button your shirt.\" His hazel eyes twinkled as he smiled.\nPrideful me, kept my brown eyes engaged with his. I touched the top of my shirt. Realizing it had come unbuttoned, I glanced down. A small piece of mistletoe rested between the crevasse of my breasts. My eyes went back to his.\nHe kept his grin as I buttoned my shirt. The tiny piece of the renegade fell further in between my breasts. I swear it had turned into a worm making itself at home. I turned away, tucked two fingers like chopsticks down my bra and pulled the piece out. \nIn my peripheral vision, I noticed the handsome man had not missed a thing. Nonchalant, I said, \"Now that you've had your peep show, what is it you're looking for?\" I walked around the counter and waited.\nHe scrolled his cell phone. \"Actually, I need to look it up.\"\nBeing the only girl in a Mexican family with six brothers, all older than me, I didn't get embarrassed easily. Even though I was raised like a boy, I was taught it was a sign of weakness to hide who I was born to be -- a woman. I was always told by the women in my family to never be ashamed of my shape, at the same time, I shouldn't flaunt my body. My oldest brother Marcos, would tell me, \"A man doesn't know what to do with a lady who is confident, sure of what she wants and stands her ground on what she believes.\"\n The customer informed me, \"I'm looking for an old poem book.\" He handed me his phone. A jolt of electricity transferred from my hand to his. \nHe quickly pulled his hand back and said, \"boy, you are a fiery one.\"\nIgnoring his comment, I stared at the phone's screen. The sight of two golden bells under the title, \"The Unheard Christmas Melodies\" caused my knees to weaken. Memories of my abuelita, who recently passed away, flooded my mind. \n\"You do, have it? Don't you?\" The stranger sounded concerned. \"I was told your store had a copy.\"\nKeeping my tears at bay, I cleared my throat and said, \"This way.\" I led him to the back of the store and wiped my escaped tears.\n\"You have no idea how long I've been searching for this book. I'm glad you have it.\"\nI swallowed my sadness and asked, \"Is this for someone special?\"\n\"Yes. It's a Christmas present for my grandfather.\"\nI pulled the small book off the shelf, then faced the stranger. A tear rolled down my cheek as I handed the book to him, but I didn't release it.\n\"Is this book special to you?\" He asked as he held the edge of the book.\nI nodded. I released the book. Without a word, I walked back to the counter.\nThe man handed me a twenty-dollar bill. \"May I ask, why is it special?\"\nKeeping my eyes on the register, I answered, \"It's the last copy in our store of my grandmother's first set of poems.\"\n\"Your grandmother wrote this book?\"\n\"Yes, she did. Why does this surprise you?\"\n\"Not as much a surprise as a strange coincidence. Your grandmother's set of poems was the first book my grandfather published. It brought recognition and business to his small publishing company. He's celebrating fifty-five years of business this coming weekend before he closes the company in a few months.\"\nWith the one cent change on the counter, I gripped the register. \n\"I'm sorry to take the last copy, but I hope you understand why I must purchase the book.\" He took the penny and placed it in the small dish of change.\n\"I do. My grandmother would be happy to know who's going to own it.\" \nHe reached for my hand, held it and said, \"Thanks for understanding.\"\nThe stranger walked to the door. \"Jingle, Jingle.\" New York's December wind reached my face. He stopped, returned to the counter, searched my eyes, then asked \"Would you like to join me at my grandfather's dinner celebration?\" \nI felt my face heat up. Before I could process any thoughts, my head nodded yes.\n\"It's this Saturday at six. Can you come?\" His enthusiastic voice flipped my heart.\n\"I can.\" I sheepishly answered and checked my shirt's buttons.\n\"It's a formal dinner. I thought you might want to know.\" He paused. \"Forgive my rudeness, I just realized, I didn't introduce myself, I'm Ethan Kaplan.\" He hesitated. \"What's your name?\"\n\"Margie. Margie, Gonzales.\"\n\"May I call you tomorrow, Margie? Maybe we can meet for coffee.\" \n\"Yes, and yes. Call the shop. I'll be here all day.\"\n\"You should hang a mistletoe up there.\" He pointed where the red string hung. His eyes twinkled the same way when my shirt was unbuttoned.\n\"You may think so. But I won't. I don't want to have another incident.\" I smiled.\n\"Your joyful eyes match my heart. I'm thankful you'll be coming with me. Now I have a date.\" He winked. \"I need to go. Until tomorrow, Margie.\"\n\"Until tomorrow,\" I responded. \nEthan whistled ‘It's a wonderful time of the year' on his way out.\nWith unbelief, I spun with glee and hollered, \"I have a date with a perfect stranger. I'll have to tell Mama how the mistletoe worked in an unexpected way.\" \nAs I opened a box of books a chill came over me. I felt my grandmother close to me. *Abuelita, your book of poems brought a perfect stranger into my life. Only God knew this would happen. Much like how abuelito came into your world when he needed help to find a book at the library.*\nEagerness for tomorrow swelled within me. *I don't have to dread Christmas dinner and the question; do you have a boyfriend yet? Once my aunties know about my Saturday dinner plans, they'll be asking, when is the wedding? Well, at least it'll be a different nagging question. I can put up with this question for a while.* I was glad.\nA quote of my abuelita popped in my head; *the Lord's Joy restores crushed hopes.* Relieved, I placed the new books on a shelf and began to hum a favorite Christmas carol, 'Joy to the World.'\n",
    "verse": {
      "entry": "A joyful heart is good medicine, but a crushed spirit dries up the bones.",
      "reference": "Proverbs 17:22"
    },
    "createdAt": "Tue Oct 29th"
  },
  {
    "id": "a-little-soldier-girl",
    "title": "a little soldier girl",
    "body" : "\"What do you think, sweetie? Is this the one?\" Hannah and her four-year-old child stood in front of a bird cage. In silence she prayed. Lord, please help us find the bird my daughter dreamt about. It would be helpful to have a new melody to help us during these challenging mornings.",
    "category": "short story",
    "createdAt": "Sat Oct 12th"
  },
  {
    "id": "a-seven-year-olds-confession",
    "title": "a seven-year-old's confession",
    "body" : "When will the priest come? Carmelita, a seven-year-old, sat on her hands in a confession booth. Her short legs swung as if they kept time. She looked up. This booth is high. A tall skinny man can fit in here, like Uncle Antonio. But it's not very wide. She spread her arms out. I hope they have a bigger one for Aunt Angelina.",
    "category": "short story",
    "createdAt": "Fri Oct 5th"
  },
  {
    "id": "upside-down-wishes",
    "title":"upside down wishes",
    "body" : "On a late summer afternoon, three sisters spent time outside their farmhouse while their parents were away. The youngest, who was four years old, twirled and twirled. Her cornflower blue dress puffed into a bell shape as her loose blonde curls waved in the air. She seemed to not have a care in the world.\nKeeping watch, Marie, the oldest sister, sat reading on the front porch steps. Without looking up, she said, \"Macie, stop twirling. You might make yourself sick like Maggid did last week.\n",
    "category": "short story",
    "createdAt": "Tue Sep 24"
  },
  {
    "id": "weathered-basket",
    "title": "weathered basket",
    "body" : "With my mom's weathered gardening basket in hand, I stepped out my front door. It had not been used in over ten years. Not since my mom began to lose her sight. The last time I held it was a month after her passing, when I packed her belongings away.",
    "category": "short story",
    "createdAt": "Tue Jul 25"
  },
  {
    "id": "extended-peace",
    "title": "extended peace",
    "body" : "Out of breath, Marie hiked up a steep mountain. Bells swayed from her backpack to alarm any bears of her presence. More than a mile into the hike, her lungs began to feel the change of elevation. She placed her hands on her hips. Now why am I doing this at my age? What am I trying to prove? To whom am I trying to show off?",
    "category": "short story",
    "createdAt": "Mon Jun 19"
  }
]
